mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/projects/iar/startup_s6e2d5.s
                PUBWEAK BT5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT5_IRQHandler
                B       BT5_IRQHandler

                PUBWEAK BT6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT6_IRQHandler
                B       BT6_IRQHandler

                PUBWEAK BT7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT7_IRQHandler
                B       BT7_IRQHandler

                PUBWEAK DT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DT_IRQHandler
                B       DT_IRQHandler

                PUBWEAK WC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
WC_IRQHandler
                B       WC_IRQHandler

                PUBWEAK EXTBUS_ERR_GDC_SDRAM_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXTBUS_ERR_GDC_SDRAM_IRQHandler
                B       EXTBUS_ERR_GDC_SDRAM_IRQHandler

                PUBWEAK RTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
RTC_IRQHandler
                B       RTC_IRQHandler

                PUBWEAK EXINT8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT8_IRQHandler
                B       EXINT8_IRQHandler

                PUBWEAK EXINT9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT9_IRQHandler
                B       EXINT9_IRQHandler

                PUBWEAK EXINT10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT10_IRQHandler
                B       EXINT10_IRQHandler

                PUBWEAK EXINT11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT11_IRQHandler
                B       EXINT11_IRQHandler

                PUBWEAK EXINT12_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT12_IRQHandler
                B       EXINT12_IRQHandler

                PUBWEAK EXINT13_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT13_IRQHandler
                B       EXINT13_IRQHandler

                PUBWEAK EXINT14_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT14_IRQHandler
                B       EXINT14_IRQHandler

                PUBWEAK EXINT15_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT15_IRQHandler
                B       EXINT15_IRQHandler

                PUBWEAK TIM_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
TIM_IRQHandler
                B       TIM_IRQHandler

                PUBWEAK MFS0_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS0_RX_IRQHandler
                B       MFS0_RX_IRQHandler

                PUBWEAK MFS0_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS0_TX_IRQHandler
                B       MFS0_TX_IRQHandler

                PUBWEAK MFS1_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS1_RX_IRQHandler
                B       MFS1_RX_IRQHandler

                PUBWEAK MFS1_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS1_TX_IRQHandler
                B       MFS1_TX_IRQHandler

                PUBWEAK MFS2_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS2_RX_IRQHandler
                B       MFS2_RX_IRQHandler

                PUBWEAK MFS2_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS2_TX_IRQHandler
                B       MFS2_TX_IRQHandler

                PUBWEAK MFS3_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS3_RX_IRQHandler
                B       MFS3_RX_IRQHandler

                PUBWEAK MFS3_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS3_TX_IRQHandler
                B       MFS3_TX_IRQHandler

                PUBWEAK MFS4_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS4_RX_IRQHandler
                B       MFS4_RX_IRQHandler

                PUBWEAK MFS4_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS4_TX_IRQHandler
                B       MFS4_TX_IRQHandler

                PUBWEAK MFS5_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS5_RX_IRQHandler
                B       MFS5_RX_IRQHandler

                PUBWEAK MFS5_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS5_TX_IRQHandler
                B       MFS5_TX_IRQHandler

                PUBWEAK MFS6_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS6_RX_IRQHandler
                B       MFS6_RX_IRQHandler

                PUBWEAK MFS6_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS6_TX_IRQHandler
                B       MFS6_TX_IRQHandler

                PUBWEAK MFS7_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS7_RX_IRQHandler
                B       MFS7_RX_IRQHandler

                PUBWEAK MFS7_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS7_TX_IRQHandler
                B       MFS7_TX_IRQHandler

                PUBWEAK ADC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC0_IRQHandler
                B       ADC0_IRQHandler

                PUBWEAK ADC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC1_IRQHandler
                B       ADC1_IRQHandler

                PUBWEAK USB0_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_F_IRQHandler
                B       USB0_F_IRQHandler

                PUBWEAK USB0_H_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_H_F_IRQHandler
                B       USB0_H_F_IRQHandler

                PUBWEAK CANFD0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
CANFD0_IRQHandler
                B       CANFD0_IRQHandler

                PUBWEAK DMAC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC0_IRQHandler
                B       DMAC0_IRQHandler

                PUBWEAK DMAC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC1_IRQHandler
                B       DMAC1_IRQHandler

                PUBWEAK DMAC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC2_IRQHandler
                B       DMAC2_IRQHandler

                PUBWEAK DMAC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC3_IRQHandler
                B       DMAC3_IRQHandler

                PUBWEAK DMAC4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC4_IRQHandler
                B       DMAC4_IRQHandler

                PUBWEAK DMAC5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC5_IRQHandler
                B       DMAC5_IRQHandler

                PUBWEAK DMAC6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC6_IRQHandler
                B       DMAC6_IRQHandler

                PUBWEAK DMAC7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC7_IRQHandler
                B       DMAC7_IRQHandler

                PUBWEAK DSTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_IRQHandler
                B       DSTC_IRQHandler

                PUBWEAK GDC_CMD_SEQ_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_CMD_SEQ_IRQHandler
                B       GDC_CMD_SEQ_IRQHandler

                PUBWEAK GDC_BLT_ENG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_BLT_ENG_IRQHandler
                B       GDC_BLT_ENG_IRQHandler

                PUBWEAK GDC_DRW_ENG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DRW_ENG_IRQHandler
                B       GDC_DRW_ENG_IRQHandler

                PUBWEAK GDC_CONT_STRM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_CONT_STRM0_IRQHandler
                B       GDC_CONT_STRM0_IRQHandler

                PUBWEAK GDC_SAFE_STRM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_SAFE_STRM0_IRQHandler
                B       GDC_SAFE_STRM0_IRQHandler

                PUBWEAK GDC_DISP_STRM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP_STRM0_IRQHandler
                B       GDC_DISP_STRM0_IRQHandler

